app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        render json: Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 57], ["LIMIT", 1]]
---
    def show
        recipe = Recipe.find_by(id: params[:id])

INSERT INTO "recipes" ("user_id", "title", "instructions", "minutes_to_complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        recipe = @current_user.recipes.create!(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? AND "recipes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 32], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 58]]
---
    def destroy
        recipe = @current_user.recipes.find_by(id: params[:id])
        if recipe
        recipe.destroy

UPDATE "recipes" SET "id" = ?, "minutes_to_complete" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["id", 0], ["minutes_to_complete", 1], ["updated_at", "2021-10-05 23:15:01.182606"], ["id", 63]]
---
    def update
        recipe = @current_user.recipes.update(recipe_params)